yechan03/2026ESWContest_free_CoreCat/corecast_gateway/STM32_WPAN/App/app_ble.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    app_ble.c
  * @author  MCD Application Team
  * @brief   BLE Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "log_module.h"
#include "ble_core.h"
#include "uuid.h"
#include "svc_ctl.h"
#include "baes.h"
#include "pka_ctrl.h"
#include "ble_timer.h"
#include "app_ble.h"
#include "host_stack_if.h"
#include "ll_sys_if.h"
#include "stm32_rtos.h"
#include "otp.h"
#include "stm32_timer.h"
#include "stm_list.h"
#include "advanced_memory_manager.h"
#include "blestack.h"
#include "gatt_client_app.h"
/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include <stdio.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Security parameters structure */
typedef struct
{
  /* IO capability of the device */
  uint8_t ioCapability;

  /**
   * Authentication requirement of the device
   * Man In the Middle protection required?
   */
  uint8_t mitm_mode;

  /* Bonding mode of the device */
  uint8_t bonding_mode;

  /* Minimum encryption key size requirement */
  uint8_t encryptionKeySizeMin;

  /* Maximum encryption key size requirement */
  uint8_t encryptionKeySizeMax;

  /**
   * this flag indicates whether the host has to initiate
   * the security, wait for pairing or does not have any security
   * requirements.
   * 0x00 : no security required
   * 0x01 : host should initiate security by sending the slave security
   *        request command
   * 0x02 : host need not send the clave security request but it
   * has to wait for pairing to complete before doing any other
   * processing
   */
  uint8_t initiateSecurity;
  /* USER CODE BEGIN tSecurityParams */

  /* USER CODE END tSecurityParams */
}SecurityParams_t;

typedef struct
{
  /* GAP service handle */
  uint16_t gapServiceHandle;

  /* GAP device name characteristic handle */
  uint16_t gapDevNameCharHandle;

  /* GAP appearance characteristic handle */
  uint16_t gapAppearanceCharHandle;

  /**
   * connection handle of the current active connection
   * When not in connection, the handle is set to 0xFFFF
   */
  uint16_t connectionHandle;

  /* Security requirements of the host */
  SecurityParams_t bleSecurityParam;

  APP_BLE_ConnStatus_t Device_Connection_Status;
  /* USER CODE BEGIN PTD_1 */

  /* USER CODE END PTD_1 */
}BleApplicationContext_t;

/* Private defines -----------------------------------------------------------*/
/* GATT buffer size (in bytes)*/
#define BLE_GATT_BUF_SIZE \
          BLE_TOTAL_BUFFER_SIZE_GATT(CFG_BLE_NUM_GATT_ATTRIBUTES, \
                                     CFG_BLE_NUM_GATT_SERVICES, \
                                     CFG_BLE_ATT_VALUE_ARRAY_SIZE)

#define BLE_HOST_EVENT_BUF_SIZE   CFG_BLE_HOST_EVENT_BUF_SIZE

#define MBLOCK_COUNT              (BLE_MBLOCKS_CALC(PREP_WRITE_LIST_SIZE, \
                                                    CFG_BLE_ATT_MTU_MAX, \
                                                    CFG_BLE_NUM_LINK) \
                                   + CFG_BLE_MBLOCK_COUNT_MARGIN)

#define BLE_DYN_ALLOC_SIZE \
        (BLE_TOTAL_BUFFER_SIZE(CFG_BLE_NUM_LINK, MBLOCK_COUNT, (CFG_BLE_EATT_BEARER_PER_LINK * CFG_BLE_NUM_LINK)))

#define BLE_DEFAULT_PIN            (111111) /* Default PIN code for pairing */

/* Dummy value for NVM buffer in RAM for BLE Host stack */
#define BLE_HOST_NVM_SIZE_U64          4
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
static tListNode BleAsynchEventQueue;

static uint8_t a_BdAddr[BD_ADDR_SIZE];
/* Identity root key used to derive IRK and DHK(Legacy) */
static uint8_t a_BLE_CfgIrValue[16];

/* Encryption root key used to derive LTK(Legacy) and CSRK */
static uint8_t a_BLE_CfgErValue[16];
static BleApplicationContext_t bleAppContext;
GATT_CLIENT_APP_ConnHandle_Notif_evt_t clientHandleNotification;

static char a_GapDeviceName[] = {  'S', 'T', 'M', '3', '2', 'W', 'B', 'A' }; /* Gap Device Name */

static AMM_VirtualMemoryCallbackFunction_t BLE_EVENTS_ResumeFlowProcessCb;

/* Host stack init variables */
static BleStack_init_t pInitParams;

/* Host stack buffers */
PLACE_IN_SECTION("TAG_HostStack") static uint32_t host_buffer[DIVC(BLE_DYN_ALLOC_SIZE, 4)];
PLACE_IN_SECTION("TAG_HostStack") static uint32_t gatt_buffer[DIVC(BLE_GATT_BUF_SIZE, 4)];
PLACE_IN_SECTION("TAG_HostStack") static uint16_t host_event_buffer[DIVC(BLE_HOST_EVENT_BUF_SIZE, 2)];
PLACE_IN_SECTION("TAG_HostStack") static uint64_t host_nvm_buffer[BLE_HOST_NVM_SIZE_U64];
PLACE_IN_SECTION("TAG_HostStack") static uint8_t long_write_buffer[CFG_BLE_LONG_WRITE_DATA_BUF_SIZE];
PLACE_IN_SECTION("TAG_HostStack") static uint8_t extra_data_buffer[CFG_BLE_EXTRA_DATA_BUF_SIZE];

/* USER CODE BEGIN PV */
typedef struct {
    uint8_t mac[6];      // 디바이스 MAC 주소 (Little-Endian)
    uint8_t led_index;   // 이 디바이스가 켤 LED 번호 (0~9)
    uint32_t last_tick;  // 이 디바이스의 마지막 데이터 수신 시간 (개별 속도 조절 및 타임아웃용)
    uint8_t is_active;   // 현재 연결(수신) 상태인지 여부 (1: 켜짐, 0: 꺼짐)
} DeviceStatus_t;

DeviceStatus_t myDevices[12] = {
    {{0x01,0xEE,0xDD,0xCC,0xBB,0xCA}, 0, 0, 0},
    {{0x02,0xEE,0xDD,0xCC,0xBB,0xCA}, 1, 0, 0},
    {{0x03,0xEE,0xDD,0xCC,0xBB,0xCA}, 2, 0, 0},
    {{0x04,0xEE,0xDD,0xCC,0xBB,0xCA}, 3, 0, 0},
    {{0x05,0xEE,0xDD,0xCC,0xBB,0xCA}, 4, 0, 0},
    {{0x06,0xEE,0xDD,0xCC,0xBB,0xCA}, 5, 0, 0},
    {{0x07,0xEE,0xDD,0xCC,0xBB,0xCA}, 6, 0, 0},
    {{0x08,0xEE,0xDD,0xCC,0xBB,0xCA}, 7, 0, 0},
    {{0x09,0xEE,0xDD,0xCC,0xBB,0xCA}, 8, 0, 0},
    {{0x0A,0xEE,0xDD,0xCC,0xBB,0xCA}, 9, 0, 0},
    {{0x0B,0xEE,0xDD,0xCC,0xBB,0xCA}, 10, 0, 0},
    {{0x0C,0xEE,0xDD,0xCC,0xBB,0xCA}, 11, 0, 0},
};

#define BLE_QUEUE_SIZE 16 // 12개가 쏘므로 넉넉하게 늘림
typedef struct {
    uint8_t device_id;
    int16_t temp1_x100;
    int16_t temp2_x100;
    int16_t angle_x_x100;
    int16_t angle_y_x100;
    int16_t angle_z_x100;
    int16_t core_temp_x100;   /* mfg_data[13..14] : ESP core_temp x100 (int16 LE) */
} ble_msg_t;

static ble_msg_t ble_queue[BLE_QUEUE_SIZE];
static volatile uint8_t ble_q_head = 0;
static volatile uint8_t ble_q_tail = 0;
volatile uint32_t ble_queue_overflow_count = 0;

static void ble_queue_push(ble_msg_t *data)
{
    uint8_t next = (ble_q_head + 1) % BLE_QUEUE_SIZE;
    if (next == ble_q_tail)
    {
        ble_queue_overflow_count++;
        return; /* 큐 가득 -> 버림 */
    }
    ble_queue[ble_q_head] = *data;
    ble_q_head = next;
}

int ble_queue_pop(ble_msg_t *msg)
{
    if (ble_q_head == ble_q_tail) return 0; /* 비어있음 */
    *msg = ble_queue[ble_q_tail];
    ble_q_tail = (ble_q_tail + 1) % BLE_QUEUE_SIZE;
    return 1;
}
/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/

/* USER CODE BEGIN GV */

/* USER CODE END GV */

