yechan03/2026ESWContest_free_CoreCat/corecast_gateway/STM32_WPAN/App/app_ble.c
                  // 2. 우리 기기라면 데이터 파싱 진행
                  if (found_idx != -1) {
                	  printf("[BLE_RX] dev=%d data_len=%d tick=%lu\r\n", found_idx, data_len, HAL_GetTick());
                	  uint8_t j = 0;

                      while (j < data_len) {
                          uint8_t field_len = adv_data[j];

                          if (field_len == 0 || (j + field_len) >= data_len)
                              break;

                          uint8_t field_type = adv_data[j + 1];

                          // field_type이 0xFF(Manufacturer Data), 최소 길이 14 (구 포맷) 이상이면 처리
                          // 구 포맷: type1B + CID2B + temp1/temp2/x/y/z 각2B + reason1B          = 14B
                          // 신 포맷: type1B + CID2B + temp1/temp2/x/y/z 각2B + ESP_ID1B + core_temp2B = 16B
                          // → 신/구 둘 다 수용. core_temp는 길이가 될 때만 읽는다.
                          if (field_type == 0xFF && field_len >= 14) {
                              uint8_t cid_low  = adv_data[j + 2];
                              uint8_t cid_high = adv_data[j + 3];

                              if (cid_low == 0x34 && cid_high == 0x12) {
                                  if (HAL_GetTick() - myDevices[found_idx].last_tick >= 900) {
                                      myDevices[found_idx].last_tick = HAL_GetTick();
                                      myDevices[found_idx].is_active = 1;

                                      ble_msg_t data;
                                      data.device_id          = found_idx;
                                      data.temp1_x100         = (int16_t)(adv_data[j+4]  | ((uint16_t)adv_data[j+5]  << 8));
                                      data.temp2_x100         = (int16_t)(adv_data[j+6]  | ((uint16_t)adv_data[j+7]  << 8));
                                      data.angle_x_x100       = (int16_t)(adv_data[j+8]  | ((uint16_t)adv_data[j+9]  << 8));
                                      data.angle_y_x100       = (int16_t)(adv_data[j+10] | ((uint16_t)adv_data[j+11] << 8));
                                      data.angle_z_x100       = (int16_t)(adv_data[j+12] | ((uint16_t)adv_data[j+13] << 8));
                                      /* 신 포맷일 때만: adv_data[j+14]=ESP_DEVICE_ID(미사용), adv_data[j+15..16]=core_temp */
                                      if (field_len >= 16)
                                          data.core_temp_x100 = (int16_t)(adv_data[j+15] | ((uint16_t)adv_data[j+16] << 8));
                                      else
                                          data.core_temp_x100 = 0;

                                      ble_queue_push(&data);
                                  }
                              }
                          }

                          j += field_len + 1;
                      }
                  }

                  // num_reports가 2 이상일 때 다음 report로 이동
                  p_data += 9 + data_len + 1;
              }
          }
          /* USER CODE END HCI_EVT_LE_ADVERTISING_REPORT */
          break; /* HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE */
        }
        case HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE:
        {
          hci_le_extended_advertising_report_event_rp0 *p_ext_adv_report;
          p_ext_adv_report = (hci_le_extended_advertising_report_event_rp0 *) p_meta_evt->data;
          UNUSED(p_ext_adv_report);
          /* USER CODE BEGIN HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE */

          /* USER CODE END HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE */
          break; /* HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE */
        }
        /* USER CODE BEGIN SUBEVENT */

        /* USER CODE END SUBEVENT */
        default:
        {
          LOG_DEBUG_BLE("SVCCTL_App_Notification: unhandled SUBEVENT with opcode: 0x%02X\n", p_meta_evt->subevent);
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
        }
      }

      /* USER CODE BEGIN META_EVT */

      /* USER CODE END META_EVT */
    }
    break; /* HCI_LE_META_EVT_CODE */

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
    {
      p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ECODE */

        /* USER CODE END ECODE */
        case ACI_L2CAP_CONNECTION_UPDATE_REQ_VSEVT_CODE:
        {
          aci_l2cap_connection_update_req_event_rp0 *p_l2cap_conn_update_req;
          uint8_t req_resp = 0x01;
          p_l2cap_conn_update_req = (aci_l2cap_connection_update_req_event_rp0 *) p_blecore_evt->data;
          UNUSED(p_l2cap_conn_update_req);

          /* USER CODE BEGIN EVT_L2CAP_CONNECTION_UPDATE_REQ */

          /* USER CODE END EVT_L2CAP_CONNECTION_UPDATE_REQ */

          ret = aci_l2cap_connection_parameter_update_resp(p_l2cap_conn_update_req->Connection_Handle,
                                                           p_l2cap_conn_update_req->Interval_Min,
                                                           p_l2cap_conn_update_req->Interval_Max,
                                                           p_l2cap_conn_update_req->Latency,
                                                           p_l2cap_conn_update_req->Timeout_Multiplier,
                                                           CONN_CE_LENGTH_MS(10),
                                                           CONN_CE_LENGTH_MS(10),
                                                           p_l2cap_conn_update_req->Identifier,
                                                           req_resp);
          if(ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : aci_l2cap_connection_parameter_update_resp command\n");
          }
          else
          {
            LOG_INFO_APP("  Success: aci_l2cap_connection_parameter_update_resp command\n");
          }

          break;
        }
        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
        {
          aci_gap_proc_complete_event_rp0 *p_gap_proc_complete;
          p_gap_proc_complete = (aci_gap_proc_complete_event_rp0*) p_blecore_evt->data;
          UNUSED(p_gap_proc_complete);

          LOG_INFO_APP(">>== ACI_GAP_PROC_COMPLETE_VSEVT_CODE\n");
          /* USER CODE BEGIN EVT_GAP_PROCEDURE_COMPLETE */
          APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_START);
          /* USER CODE END EVT_GAP_PROCEDURE_COMPLETE */
          break; /* ACI_GAP_PROC_COMPLETE_VSEVT_CODE */
        }
        case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
        {
          /* USER CODE BEGIN RADIO_ACTIVITY_EVENT */

          /* USER CODE END RADIO_ACTIVITY_EVENT */
          break; /* ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE */
        }
        case ACI_GAP_PASS_KEY_REQ_VSEVT_CODE:
        {
          uint32_t pin;
          LOG_INFO_APP(">>== ACI_GAP_PASS_KEY_REQ_VSEVT_CODE\n");

